interface Src {
	title: string;
	description: string;
}
interface Info {
	[key: string]: Src;
}
const info = {
	"/top.glb": {
		title: "Головка цилиндра",
		description: "Это важнейший элемент двигателя, отвечающий за герметизацию камеры сгорания и работу клапанного механизма. Её исправность критически важна для эффективной работы двигателя.",
	},
	"/karter.glb": {
		title: "Крышка картера",
		description:
			"Это важная часть двигателя внутреннего сгорания, выполняющая как защитные, так и функциональные задачи. Она закрывает нижнюю часть картера, где размещаются вращающиеся детали двигателя, такие как коленчатый вал, шатуны и другие элементы.",
	},
	"/boxEngine.glb": {
		title: "Картер с цилиндром",
		description:
			"Цилиндр — это основная рабочая часть двигателя, представляющая собой полую цилиндрическую деталь, внутри которой движется поршень. Его главная задача — создание направляющей для возвратно-поступательного движения поршня и формирование пространства для камеры сгорания.\n Картер — это корпусная часть двигателя, которая выполняет функции поддержки и защиты всех основных деталей. Он объединяет двигатель в единое целое и обеспечивает надежность его работы.",
	},
	"/cilin.glb": {
		title: "Рёбра охлаждения цилиндра",
		description: "Это элементы конструкции цилиндра двигателя внутреннего сгорания, предназначенные для эффективного отвода тепла. Они представляют собой выступающие ребристые поверхности, увеличивающие площадь теплоотдачи.",
	},
	"/karter2.glb": {
		title: "Крышка картера",
		description:
			"Это важная часть двигателя внутреннего сгорания, выполняющая как защитные, так и функциональные задачи. Она закрывает нижнюю часть картера, где размещаются вращающиеся детали двигателя, такие как коленчатый вал, шатуны и другие элементы.",
	},
	"/porsh.glb": {
		title: "Поршень ",
		description:
			"Это одна из ключевых деталей двигателя внутреннего сгорания (ДВС), которая выполняет функцию преобразования энергии сгорания топлива в механическую работу. Он двигается внутри цилиндра и является важным элементом кривошипно-шатунного механизма.",
	},
	"/pal.glb": {
		title: "Поршневой палец",
		description: "Это цилиндрический элемент, соединяющий поршень с верхней головкой шатуна. Он позволяет передавать усилие, возникающее при работе двигателя, от поршня на шатун.",
	},
	"/karb.glb": {
		title: "Карбюратор ",
		description:
			"Это устройство в двигателе внутреннего сгорания, которое смешивает воздух с топливом в нужных пропорциях для их сгорания в цилиндрах. Он используется в бензиновых двигателях, чтобы обеспечить правильное топливо-воздушное соотношение для эффективной работы двигателя.",
	},
	"/vozd.glb": {
		title: "Патрубок воздушного фильтра",
		description:
			"Это элемент системы впуска воздуха в двигатель, который соединяет фильтр воздуха с карбюратором (или впускным коллектором в случае современных двигателей с инжекторами). Его основная функция — направлять воздух в двигатель, чтобы обеспечить правильную работу топливо-воздушной смеси.",
	},
	"/shatun.glb": {
		title: "Шатун",
		description:
			"Это одна из ключевых деталей кривошипно-шатунного механизма двигателя внутреннего сгорания. Его основная функция — передача усилия от поршня к коленчатому валу, преобразуя возвратно-поступательное движение поршня в вращательное движение коленчатого вала.",
	},
	"/vipusk.glb": {
		title: "Выпускной коллектор",
		description: "Это элемент, который выполняет важную роль в отведении отработанных газов из камеры сгорания.",
	},
	"/zaziganie.glb": {
		title: "Статор зажигания",
		description: "Это часть системы зажигания, которая генерирует электрический ток для создания искры в свечах зажигания. Статор является важным элементом в двигателях внутреннего сгорания.",
	},
	"/remen.glb": {
		title: "Приводной ремень",
		description:
			"Это элемент механической передачи, который используется для передачи крутящего момента от одного вращающегося элемента (например, двигателя) к другому (например, генератору, компрессору, водяной помпе или выходному валу). Приводной ремень работает на основе трения, передавая вращение от ведущего вала к ведомому.",
	},
	"/svecha.glb": {
		title: "Свеча зажигания",
		description: "Это ключевой компонент системы зажигания в двигателе внутреннего сгорания. Она используется для воспламенения топливно-воздушной смеси в камере сгорания, создавая искру с высоким напряжением.",
	},
	"/zaschita.glb": {
		title: "Защита двигателя",
		description:
			"Это совокупность технических решений и устройств, которые предотвращают повреждения двигателя и продлевают срок его службы, а также обеспечивают его стабильную и безопасную работу. Защита может быть как механической, так и электронной, в зависимости от конструкции двигателя и его применения.",
	},
	"/krep.glb": {
		title: "Крепление двигателя",
		description:
			"Это система элементов, которая фиксирует двигатель внутри транспортного средства или другого механизма, соединяя его с рамой или кузовом. Правильное крепление двигателя обеспечивает устойчивость, снижение вибраций и защиту двигателя от повреждений во время работы.",
	},
	"/vihod.glb": {
		title: "Выходной вал",
		description:
			"Это элемент механической системы, который передает вращательное движение и крутящий момент от двигателя или другого источника мощности к конечному рабочему механизму. Выходной вал является завершающим звеном передачи энергии в трансмиссии.",
	},
	"/mehanizm.glb": {
		title: "Коленчатый вал",
		description:
			"это ключевой компонент кривошипно-шатунного механизма, который преобразует поступательное движение поршней в цилиндрах двигателя во вращательное движение, передаваемое на трансмиссию. Коленчатый вал используется в двигателях внутреннего сгорания, компрессорах, насосах и других устройствах, где требуется преобразование движения.",
	},
	"/ship.glb": {
		title: "Шатунно-кривошипное соединение",
		description:
			"Это важный узел кривошипно-шатунного механизма, который обеспечивает передачу усилий между шатуном и коленчатым валом. Крепление должно быть прочным, надежным и способным выдерживать высокие нагрузки, возникающие при работе механизма.",
	},
};
export default info;
